[
  {
    "path": "posts/2023-04-26-betterposter-at-egu-2023/",
    "title": "#betterposter at EGU 2023",
    "description": "Using `posterdown` to build better posters.",
    "author": [
      {
        "name": "Lorena Abad",
        "url": {}
      }
    ],
    "date": "2023-04-26",
    "categories": [
      "r-spatial",
      "dataviz",
      "scicomm",
      "posterdown",
      "rstats",
      "egu23"
    ],
    "contents": "\n\nContents\nEGU23 so far\nPosters@EGU23\nTip #1\nTip #2\nTip #3\n\nThe final product!\n\nEGU23 so far\nWhile I am sitting at #EGU23 I am happy to be surrounded by so many scientists who care about the environment and are willing to go beyond their own topics to engage with the public and understand the ways we can work together towards a common goal.\nI am delighted to also find a small but hopefully growing community of software developers and research software engineers around, fully passionate about FAIR principles and open science.\nTwo and a half more days are left and I have learned so much from different topics that I will probably need a couple of weeks to let everything sink in.\nPosters@EGU23\nWalking through the poster sessions is quite inspiring and I am glad to see several people taking up on the #betterposter initiative by Mike Morrison (@mikemorrison).\nI tried this template myself this year for my poster contribution this year and of course I used R for it.\nFor this I turned to posterdown by Brent Thorne (@wbrentthorne).\nThe package uses rmarkdown to create your poster, helping you to go seamlessly from your documented work or article draft, to different poster templates.\nI enjoyed the flexibility you have with the package to display your results, and how it could be a great way to present interactive content for example at the PICO sessions at #EGU23 since the output from posterdown is an HTML document.\nI will not go through how to create a poster using the package, since the documentation has quite some information that will help you create your own #betterposter, but I will list a couple of tips that turned out useful for my poster building.\nTip #1\n\nAvoid headaches, use Google Fonts.\n\nI had a really cool font installed locally and I wanted to use it for my poster. Result: error during rendering.\nposterdown uses Chrome or Chromium for rendering, and using fonts that are not available on the web can be a hassle.\nIf you still want to use your very cool font, a good option is to look for it at similarfont.io, which can give you some ideas of alternative Google Fonts.\nTip #2\n\nWant to adapt the <style>, go thorugh the HTML templates.\n\nOnce I was on the final steps of my poster development, I wanted to change this little details like padding around titles, font sizes, and so on.\nSome of these could be set on the file YAML, but others not. Also if you change from the posterdown::posterdown_betterport to posterdown::posterdown_betterland, some variables might not be named the same accross those.\nWhat saved me some time was going through the HTML templates on the posterdown repo. For example, find the one for the better landscape template here.\nGoing through the template will reveal to you if what you want to change is a YAML parameter, most likely when the line starts with $if(parameter_name).\nIf it is not a YAML parameter, you can add an HTML chunk to your RMarkdown file that will hopefully override the settings you want (it does not always work or I lack the HTML/CSS knowledge to figure out why!)\nThis are the HTML changes I made to my poster:\n\n<style>\n.outer h1 {\n text-align: center;\n margin-top: 0.6in;\n margin-bottom: -0.4in;\n}\ncaption {\n margin-top: 0px;\n margin-bottom: 2px;\n padding-top: 0in;\n padding-bottom: 0in;\n font-size: 23pt;\n}\n.caption {\n margin-top: -2px;\n margin-bottom: 2px;\n padding-top: 0in;\n padding-bottom: 0in;\n font-size: 23pt;\n}\n.main p {\n padding-top: 0%;\n text-align: center;\n}\n.main_pic {\n margin-top: -1in;\n display: inline-block;\n text-align: center;\n}\n<\/style>\n\nTip #3\n\nUsing tmap to show results? Take some shortcuts when designing\n\ntmap by Martijn Tennekes (@MartijnTennekes) is an excellent package to generate beautiful maps, especially if you want to combine raster and vector data.\nBut, designing your figure might be hard when you want to add legends, or distinct elements and you suddenly have white space all around.\nThis can become specially frustrating when the space in your poster is not infinite. Version 4 for tmap is soon coming, but in the meantime I still use the CRAN version to build my plots. I find tmap::tm_add_legend() and tmap::tmap_arrange() excellent functions to work around design issues, and one shortcut I usually take is to build my legend separate from the map, so that I can work with the space in an easier way.\nBut, problem incoming! When I tried to print two different figures in RMarkdown, i.e. the actual plot and the legend in a single code chunk, the figure width and height was used for both figures, without options to provide different heights.\nResult? I had a very big white space below my legend.\nSolution? Use two code chunks! This will allow you to give different dimensions to each output.\nIf you need to add a figure caption, do it on the second plot, and to avoid an empty line between two figures, place your code chunks completely together, with no line break:\n\n```{r}\n#| label: figure\n#| fig-width: 10\n#| fig-height: 10\n#| crop: true\nlibrary(tmap)\ntm1 = tm_shape(data) +\n  tm_polygons() \ntm2 = tm_shape(data) +\n  tm_polygons() \ntmap_arrange(tm1, tm2)\n```\n```{r}\n#| label: legend\n#| fig-width: 10\n#| fig-height: 1\n#| fig-cap: \"Your figure caption.\"\n#| crop: true\ntm_shape(data) +\n  tm_polygons(legend.show = FALSE) +\n  tm_add_legend()\n```\n\nThe final product!\nAnd here it is, the final poster at EGU! This is my first poster and I am happy to have found some interesting tools to come up with a nice result using R!\n\n\n\n\n\n\n",
    "preview": "posts/2023-04-26-betterposter-at-egu-2023/figs/poster_thumbnail-min.PNG",
    "last_modified": "2023-04-26T13:14:59+00:00",
    "input_file": {},
    "preview_width": 1335,
    "preview_height": 946
  },
  {
    "path": "posts/2021-11-30-30daymapchallenge-rstats/",
    "title": "#30DayMapChallenge & #RStats",
    "description": "Day 30: Metamapping day",
    "author": [
      {
        "name": "Lorena Abad",
        "url": {}
      }
    ],
    "date": "2021-11-30",
    "categories": [
      "r-spatial",
      "dataviz",
      "30daymapchallenge",
      "rstats"
    ],
    "contents": "\n\nContents\nThe challenge\nCode-driven maps\nMetamapping my challenge\nMost used R packages\nHonorable mentions\n\nWrap-up\n\nThe challenge\nSince 2019, the #30DayMapChallenge by Topi Tjukanov has brought map geeks together for a month to flood our Twitter feeds with mind-blowing maps.\nThis year, I decided to participate by making maps with R! I had a lot of fun, but it was also quite a journey. I chose as an overarching topic my home country: Ecuador. I posted each of the maps on Twitter, and these two are the ones that received most attention:\n\n\n\n#30DayMapChallenge Day 10: RasterI am usually asked how hot my country is, and I usually say, not as hot as you may think! Worldclim data is a wonderful source for #dataviz#RStats #rspatial pic.twitter.com/Fgurk6du09\n\n— Lorena Abad (@loreabad6) November 11, 2021\n\n\n\n#30DayMapChallenge Day 24: HistoricalHumboldt's travels through the AmericasI have been fascinated with this scientist and since I read The Invention of Nature by @andrea_wulf I wanted to learn more and more!#RStats #RSpatial pic.twitter.com/J5yPUqZtFY\n\n— Lorena Abad (@loreabad6) November 24, 2021\n\n\nMy personal favorite, however, is day 13. I live away from home and so many other Ecuadorians do. It was amazing to see where we all are, and how “far-away” time wise each of us is from calling our loved ones.\n\n\n\n#30DayMapChallenge Day 13: NaturalEarth data challengeWhat is a good time to call home? Timezones are a hard thing to get used to when away from home. Here is a helpful map for all those Ecuadorians living abroad. #RStats #RSpatial pic.twitter.com/i54824zsrx\n\n— Lorena Abad (@loreabad6) November 15, 2021\n\n\nYou can see my complete gallery on this GitHub repository. This post is meant to show the back-end of these maps, so here we go!\nCode-driven maps\nI get a certain satisfaction of generating maps with code. To know that a bunch of commands can result in pretty figures is not only rewarding but also helpful. The certainty that I can always go back to a piece of code to re-generate a certain plot is the peak of reproducible data visualization.\nDon’t get me wrong, GUIs are great and have many advantages, like not taking 30 minutes to figure out the best coordinates for your labels. But it is that nice feeling of seeing a map somewhere and thinking: How did this person do that? Which tools/packages did they use? Did they go through crazy workarounds to get that effect?; and then actually being able to scan the building blocks of that map and answer those questions and test those effects for yourself, that makes the difference for me.\nOf course, this can only happen when code is shared. I personally love R’s capabilities for creating nice maps/figures and I myself used only R for this challenge (except for Day 15: map without a computer).\nMany other mappers used R for their challenge as well. Here are some of the GitHub repositories and Gists I found, that used R for their challenge:\nrichardvogg | gkaramanis | schochastics | shandiya | dakvid | leeolney3 | tashapiro | bydata\nI don’t mean this in any way as a comprehensive list, but just a sample of all the creative code out there during this edition of the challenge. For some further examples check David Frigge’s awesome gallery!\nMetamapping my challenge\nThe final day of the challenge is metamapping day. According to the details one can:\n\nSpend the day either by 1) collecting your entries from the challenge to a common gallery, 2) writing a tutorial or a blog post on one of your maps or 3) create a map from a theme you have chosen yourself\n\nWell, I decided to derail a bit and write a meta blog post for all the maps I created with R. In my tweets I always tried to include the packages I used for the day, however, I used so many for this challenge, that I thought they deserved some extra love. Some packages I already knew by heart (all their ins-and-outs and awesome capabilities), but others I discovered just because of this challenge and that was pretty cool. So, I chose for Day 30 to do a simple analysis of the packages I used.\nMy first task was to collect all the packages from my 28 R scripts. I was bracing myself either to writing my own function that would find all my library() calls, or to do some manual check of each. Luckily, renv came to my rescue. Did you know you can scan all the packages your project depends on? This was exactly what I needed, so with one line:\nrenv::dependencies()\nI managed to get all of the packages I used, per script. Next tasks: summarize by number of times I called each package, and assign them a category. You can see the code I used here.\nThe final result? The packages I used for each of my self-assigned categories and how many times I used them:\n\n\n\nInsights:\nTotal number of packages used: 5️⃣9️⃣\nThere was not one package that was used every day of the challenge 🤯\nNatural Earth was very frequently a data source, given that it is my go-to package to get country polygons 😁\nWant to work with fonts on Windows? extrafont is your package! 😉\nI limited my interactive mapping quite strictly to the set day 😅\nMost used R packages\nsf\n\n\n\nTake a look again at the plot above, which package stands out the most? Beautiful sf! Simple features came here to stay and I am very glad it exists. Working with spatial data in R has never been easier, and that is because of this awesome package. I used it to read spatial data into R, to work with projections and to perform spatial analyses like joins, generating random spatial points, etc.\ndplyr\n\n\n\nThe tidyverse has made working with data in R extremely intuitive. Being able to work with structured data frames brings data science to a new level. dplyr is the first tidyverse package I learnt and I use it constantly for tasks as filtering, selecting, mutating, etc.\nggplot2\n\n\n\nAnother package of the tidyverse is ggplot2, which introduces the grammar of graphics into R and is extremely powerful to create awesome visualizations. Two main functions allow you to combine this package with spatial data: geom_sf() and geom_stars(). One interesting tip, if you learn to use coord_sf(), you can do things like assigning a CRS to your plot, although your data has a different projection, as coord_sf(crs =\"+proj=geos\")\nThis are the ggplot extensions I use the most:\n\n\nggfx\n\nTo give shading and glow effects to spatial features\nggtext\n\nTo add special formatting to text\ngganimate\n\nTo animate the plots\nggspatial\n\nTo add north arrows and spatial scales\nggnewscale\n\nTo map multiple variables to the fill/color aesthetics\nggimage\n\nTo add images in spatial locations or as annotations\nggrepel\n\nTo automatically place overlapping labels\n\n\nosmdata\n\n\n\nThis package is simply the easiest way I have come across in R to query OpenStreetMap data. I use it very often when I need to get data for small areas. For larger areas, for example a whole country, I use osmextract.\ntmap\n\n\n\nWant to plot spatial features fast and easy, static and interactive? Use tmap! I use this package a lot for my scientific publications because it allows you to use raster RGB images and vector data really easy. To get a bit more creative it has some limitations, and that is why I did not use it as often as ggplot2 on this challenge. But, one of the main features I like about this one is the ability to call tm_facets() and get individual plots of features grouped by a category, and let scales x and y be free. This is not possible with ggplot2. See that in action on Day 22: Boundaries.\nNote: This hex logo is not official yet but I love it! Waiting eagerly for version 4 of tmap to launch this nice logo and many new features!\nscico\n\n\n\nFabio Crameri provided the whole scientific community a great set of scientific color palettes to fairly represent data that is universaly readable! scico allows you to use the palettes in R. Another great source of palettes is viridis, which is already easily accessible in ggplot2 with scale_*_viridis_*().\nstars\nstars really needs a hex logo 🙏\nSpatiotemporal Arrays, Raster and Vector Data Cubes are handled neatly with stars. For anything raster or netcdf related this is my go-to package. It might be a bit complex to start with this package, but it is definitely worth it.\nOther options to work with raster data are raster and terra form the rspatial universe, which I actually use when I need to create hillshades from elevation data.\nHonorable mentions\nAlthough not on the top 7 above, there are some packages that I use frequently, but were not so used for this challenge. There are also really cool packages that I only discovered in the past month. Here is a table of how I used them:\n\n\nsfnetworks\n\nOK, I am biased here, but have you checked out sfnetworks yet? Well, if you work with spatial networks you should. I used it to compute travel time using public transport in Quito for Day 9: Monochrome\n\nrgee\n\nDo you work with Google Earth Engine? Do you want to do that via R? Then use rgee. I use it to extract RGB thumbnails of Sentinel-2 imagery. See the RGB collection for Day 6, Day 7 and Day 8\n\nrayshader\n\nFor Day 11: 3D I could not use any other package than rayshader. 3D rendering can get so creative with this package\n\nhaven\n\nOpen data can come in so many formats and with so many extensions. When I first saw a .dta or a .sav file I thought, OK now what? Luckily, haven was just there ready made for these cases!\n\nggpomological\n\nFor Day 24: Historical I wanted to make a map with an old-style look. And there it was: ggpomological! I was very happy to run into this package\n\ngggibbous\n\nI had seen moon plots in other dataviz projects before but had never tried them myself. For Day 19: Island(s) I finally got the chance!\n\nbiscale\n\nI remember I made some bivariate choropleth maps once and it required a lot of code to achieve. biscale made it easy! I really wanted to flip the legend, and I managed so if you are interested, code is there. Featured on Day 26: Choropleth\n\nleaftime & leaflet\n\nI normally handle my interactive maps with tmap or mapview, but this time I stubbornly wanted a time slider for my Day 25: Interactive map, hence I ended up learning a lot on hot to use leaflet and its addons\n\n\n\nWrap-up\nWith this challenge I wanted to show how flexible R is to generate beautiful reproducible maps. Maybe mine are not the best examples but there are so many awesome contributions out there! I hope this post helps anyone who wants to use R for spatial data visualization to point them to good resources.\nThis was my first #30DayMapChallenge, it was exciting to think of new topics every day but frustrating when Ecuador’s open data repositories either had their servers down or chose to share the data only as WMS or with no metadata. I know this does not happen only for Ecuador, as Sanna Jokela explained on her tweet for one of her contributions.\n\n\n\nThis a perfect example on how NOT to do a map in #30DayMapChallenge: do not get an idea before the data, because the everything goes åt helvete. Although it SHOULD be the otherway around! This is the reason to open data. You never know who you are enabling to do a better job.\n\n— Sanna Jokela (@SannaJokela1) November 24, 2021\n\n\nI cannot think of a better way to end this challenge. Thanks to anyone who followed my map making for 30 days, and sorry to those who follow me and were annoyed of having so many maps on your feed!\n\n\n\n",
    "preview": "posts/2021-11-30-30daymapchallenge-rstats/figs/preview.png",
    "last_modified": "2023-04-26T09:04:15+00:00",
    "input_file": {},
    "preview_width": 914,
    "preview_height": 480
  },
  {
    "path": "posts/2021-11-18-foss4grspatial/",
    "title": "FOSS4G: R-Spatial Panel",
    "description": "I was invited to an R-Spatial Panel!",
    "author": [
      {
        "name": "Lorena Abad",
        "url": {}
      }
    ],
    "date": "2021-11-18",
    "categories": [
      "r-spatial",
      "dataviz",
      "talks",
      "foss4g"
    ],
    "contents": "\n\nContents\nFOSS4G-2021\nMy presentation\nThe panel discussion\n\nFOSS4G-2021\nI attended my first FOSS4G conference this year and I really loved it! The team in Buenos Aires excelled at organizing this conference, even if we could not really go to Argentina, the online mode turned out to be an amazing experience.\nI was very happy to be able to be part of this conference not only as an attendee, but also as a panelist for the R-Spatial session. To be honest I felt quite overwhelmed initially when the invitation was extended. Being a panelist with all those big names in R-Spatial was an honor and also scary! Nevertheless, I said yes and do not regret it one single bit!\nMy presentation\nEach of the panelist had around 10 minutes for a short presentation. I decided to talk about “Reproducible spatial data visualization with R”, where I showed how with 3 simple steps and a great pool of packages to choose from you can create nice spatial dataviz in R. See a glimpse below:\n\n\nYour browser does not support iframes.\n\n\nFull link to slides here.\nThe panel discussion\nDuring the panel, we discussed the role of R-Spatial as a new member of the OSGEO community. It was a very lively discussion, with most questions coming from the audience. Overall a great experience!\nHere is the video of the session:\n\n\n\n\n\n",
    "preview": "posts/2021-11-18-foss4grspatial/figs/preview.png",
    "last_modified": "2023-04-26T09:04:15+00:00",
    "input_file": {},
    "preview_width": 761,
    "preview_height": 480
  },
  {
    "path": "posts/2021-03-05-geospatial-network-visualization/",
    "title": "Geospatial Network Visualization",
    "description": "{sfnetworks} meets {ggraph}",
    "author": [
      {
        "name": "Lorena Abad",
        "url": {}
      }
    ],
    "date": "2021-03-05",
    "categories": [
      "r-spatial",
      "dataviz",
      "networks"
    ],
    "contents": "\n\nContents\nWelcome to my website!\nWhat is this about?\nWhat can be done?\nThe Three Pillars\n1. layout_sf()\n2. geom_node_*()\n3. geom_edge_*()\n\nWhat can’t be done?\nShow me more!\n\n\n\nWelcome to my website!\nThis is the first entry for my brand new website built with distill. I hope you find this and hopefully the coming posts useful! So let’s get to it!\nWhat is this about?\n\n \n\nThis post is to document my personal exploration on how to visualize spatial networks created with sfnetworks using ggraph. This all started with a sfnetworks hackathon and should end with a successful pull request (PR) to ggraph.\nI should start by saying, that it is probably a good idea to get familiar with ggraph (and tidygraph and sfnetworks while you are at it!) before going through this post.\nIf you are already a ggraph + tidygraph user and would like to apply the possibilities to the spatial domain, then this is definitely a resource for you and a good opportunity to learn about sfnetworks!\nWhat can be done?\nThere are already several possibilities to use sfnetworks and ggraph together. Why? you may be wondering. Well because ggraph was built as a way to visualize tbl_graphs from tidygraph, and guess what? sfnetwork objects sub-classes tbl_graph. Let’s look at the roxel demo dataset from sfnetworks.\n\n\nlibrary(sfnetworks)\nlibrary(sf)\nnet = as_sfnetwork(roxel, directed = F)\nclass(net)\n\n\n[1] \"sfnetwork\" \"tbl_graph\" \"igraph\"   \n\nSo basically you can do all sort of crazy graph representations with an sfnetwork already.\nThe real aim of this integration is to allow you to do all this crazy graph representations + graph representations in geographical space! Not everything is possible yet, and you will see below some limitations.\nFor now I will illustrate how, with the current status quo, we can already integrate sfnetworks and ggraph for spatial network visualizations. So let’s get started!\nThe Three Pillars\nWe need to start with three main concepts, the essential elements to create any ggraph visualization:\n\n\n\nLayouts contain the vertical and horizontal placement of the nodes, giving them a physical placement. In spatial terms, they contain the coordinates of where each node should be mapped.\nNodes refer to which representation the nodes should have. And this really refers to which visual representation they should have, known in ggplot2 as geom. Should they be points, tiles, voronoi polygons? ggraph contains a large list of node representations via geom_node_*().\nEdges refer to the way nodes are connected between each other visually. Again here we are talking about ggplot2 geometries and the geom_edge_*() functions should give you a big pool of options to represent this.\nLet’s go through the possibilities to combine these elements with sfnetwork objects.\n1. layout_sf()\nAs mentioned before, a layout is basically the physical representation of where to place our nodes. When we are dealing with non-spatial network representations we must remember that the nodes are not meant to represent actual locations on Earth, but can be placed anywhere. ggraph provides several algorithms to make this happen. Let’s take one of the examples in the ggraph layout vignette to illustrate. This will include the layout + nodes + edges in a non-geographical representation.\n\n\nlibrary(ggraph)\nlibrary(tidygraph)\nlibrary(tidyverse)\nggraph(\n  filter(net, group_components() == 1), \n  layout = 'focus', \n  focus = node_is_center()\n) + \n  ggforce::geom_circle(aes(x0 = 0, y0 = 0, r = r), data.frame(r = 1:5), colour = 'grey') + \n  geom_edge_link() + \n  geom_node_point() + \n  coord_fixed()\n\n\n\n\nBut when talking about geospatial networks, we would usually want to place the nodes in their geographical location. A really nice thing about ggraph, is that you can give your own customized layout, by passing custom X and Y coordinates for node placement!\nIn sfnetworks, we have a spatial network consisting of nodes and edges. Since we have a nice integration with sf, we can extract the coordinates of our nodes as an X and Y coordinate dataframe, which we can pass to ggraph. Let me give you a quick demo instead of all these words.\n\n\nnet\n\n\n# A sfnetwork with 701 nodes and 851 edges\n#\n# CRS:  EPSG:4326 \n#\n# An undirected multigraph with 14 components with spatially explicit edges\n#\n# Node Data:     701 x 1 (active)\n# Geometry type: POINT\n# Dimension:     XY\n# Bounding box:  xmin: 7.522622 ymin: 51.94151 xmax: 7.546705 ymax:\n#   51.9612\n             geometry\n          <POINT [°]>\n1 (7.533722 51.95556)\n2 (7.533461 51.95576)\n3 (7.532442 51.95422)\n4  (7.53209 51.95328)\n5 (7.532709 51.95209)\n6 (7.532869 51.95257)\n# ... with 695 more rows\n#\n# Edge Data:     851 x 5\n# Geometry type: LINESTRING\n# Dimension:     XY\n# Bounding box:  xmin: 7.522594 ymin: 51.94151 xmax: 7.546705 ymax:\n#   51.9612\n   from    to name        type                                geometry\n  <int> <int> <chr>       <fct>                       <LINESTRING [°]>\n1     1     2 Havixbecke~ reside~ (7.533722 51.95556, 7.533461 51.955~\n2     3     4 Pienersall~ second~ (7.532442 51.95422, 7.53236 51.9537~\n3     5     6 Schulte-Be~ reside~ (7.532709 51.95209, 7.532823 51.952~\n# ... with 848 more rows\n\n\nnet %>% st_coordinates() %>% head()\n\n\n         X        Y\n1 7.533722 51.95556\n2 7.533461 51.95576\n3 7.532442 51.95422\n4 7.532090 51.95328\n5 7.532709 51.95209\n6 7.532869 51.95257\n\nNow, how do we create a layout that extracts the coordinates automatically? Well here is a little helper function that will take care of that for you. It will extract the X and Y coordinates of any sfnetwork object into a data.frame that is understood by ggraph().\n\n\nlayout_sf = function(graph){\n  # Extract X and Y coordinates from the nodes\n  graph = activate(graph, \"nodes\")\n  x = sf::st_coordinates(graph)[,\"X\"]\n  y = sf::st_coordinates(graph)[,\"Y\"]\n  data.frame(x, y)\n}\n\n\n\nHow do we use it? Well, like this:\n\n\nlibrary(ggraph)\nggraph(net, layout = layout_sf)\n\n\n\n\nYes! That’s it. You are probably looking now at a beautiful blank canvas, but internally ggraph() has already a plan for every node you will map next, let’s see it in action in the next step.\n2. geom_node_*()\nThe most obvious way to represent a node in space is with a point. This is how we would do it if we were plotting POINT geometries in space. With ggraph we can get that representation with geom_node_point(). Note that other useful node representations in space might be using a label or text. We can achieve that with geom_node_label() and geom_node_text(), respectively.\nBuilding on our previous plot:\n\n\nggraph(net, layout = layout_sf) +\n  geom_node_point()\n\n\n\n\nOh yes, there are our nodes! But wait… If you are familiar with the sfnetworks vignettes, you might be thinking: this looks distorted… and yes, it does.\nUnfortunately, ggraph() does not know about coordinate reference systems (CRS) so it will accommodate your X and Y axes to the size of your plot. This is one of the reasons why some internal tweaks are needed in ggraph to make this work better. But for now a way to go around this is to use coord_sf():\n\n\nggraph(net, layout = layout_sf) +\n  geom_node_point() +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nMuch better. Now, our plot also takes into consideration the CRS and places our nodes properly.\nNow let’s give some aesthetics to our plot. If you scroll back up, you will see that our nodes don’t have attributes, other than their geometry, so what should we look at? What about the degree centrality of the node? This will calculate the number of incident edges for each of our nodes. We can do this with the centrality_degree() function in tidygraph.\nA really nice feature about ggraph is that we don’t need to go back to our original graph, mutate our network, save as a new object, and then call it again inside ggraph(). We can just call the function directly inside the aes(), where the calculation will be done on the fly! Read more about it here.\n\n\nlibrary(tidygraph)\nggraph(net, layout = layout_sf) +\n  geom_node_point(aes(color = centrality_degree())) +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nDirectly passing functions also works inside facet_*() functions. sfnetworks has a couple of functions that can be evaluated in this way. To illustrate we can use node_X(), which gives us the X coordinate of the nodes.\n\n\nggraph(net, layout = layout_sf) +\n  geom_node_point(aes(color = centrality_degree())) +\n  coord_sf(crs = st_crs(net)) +\n  facet_nodes(~node_X() > 7.535)\n\n\n\n\nOK, probably not a real-world case scenario, but it gives an overview of what can be done!\nLet’s move on to the final step, and connect these nodes to each other.\n3. geom_edge_*()\nNow comes the tricky part. When we are working with graph structures in, let’s call it, “abstract” space, the connections between the nodes are basically straight lines between each from and to pair. Although ggraph has quite a long list to represent edges (see here), the connections that I find most relevant for spatial networks are geom_edge_link() and geom_edge_arc(), which create a straight line or an arc between connected nodes.\n\n\nggraph(net, layout_sf) +\n  geom_edge_arc() +\n  geom_node_point() +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nYes, I bet you are thinking this could go to accidental aRt. But depending on the visualization you are creating, this geom can come in handy for some data cases, you can see it in action at the end of this post!\nBut now let’s look at straight lines or links between our nodes. We can of course pass aesthetics to all the geom_edge_*() functions, which refer to edge attributes. Let’s color our edges by the type of road:\n\n\nggraph(net, layout_sf) +\n  geom_edge_link(aes(color = type)) +\n  geom_node_point(size = 0.75) +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nI know that for now you must be wondering: if we have a spatial set of edges with an explicit geometry, why are we just drawing plain lines? Well, remember I said this would be tricky? This is exactly what is missing from ggraph and the core of what I eventually want to implement.\nBut, do not despair! I am here to show you some workarounds, not fully ideal but something to work with in the meantime. Let’s remember that ggraph subclasses a ggplot object, so we can combine ggplot2 functions, and any other package that extends the grammar of graphics.\nWe will resort to geom_sf() for now. We can plot the edges of our network, by extracting them as an sf object with the function st_as_sf(). We have implemented a shortcut that allows you to choose which element of the network (nodes or edges), you want to activate and extract.\n\n\nggraph(net, layout = layout_sf) +\n  geom_sf(data = st_as_sf(net, \"edges\")) +\n  geom_node_point() +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nAnd there we go, a nice representation of a geospatial network! We can of course pass some aesthetics as well, for example an spatial edge predicate implemented in sfnetworks: edge_circuity(). You will see now that we can pass these predicates directly to the aesthetics inside geom_sf() and since our main object is a ggraph this expression will be evaluated in the network, pretty exciting!!\n\n\nggraph(net, layout = layout_sf) +\n  geom_sf(\n    data = st_as_sf(net, \"edges\"), size = 0.8,\n    aes(color = as.numeric(edge_circuity()))\n  ) +\n  scale_color_viridis(\"Circuity\") +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nAnd there you have it, a swift overview of how to use ggraph and sfnetworks together.\nWhat can’t be done?\nSo yes, a lot can be done already, but as you may have noticed, there are certain things that just don’t work yet with the current ggraph implementation. Here is a not at all comprehensive list of things that need some work:\nThe layout_sf() function I showed you above will not work when there are columns named x or y.\nggraph() does not consider the network CRS.\nThere is no way yet to plot spatially explicit edges inside ggraph.\nThis last one comes with a couple more problems:\nMultiple scales for the same aesthetic\nWith ggraph one can give “color”, “fill”, “size/width”, etc. aesthetics to both the nodes and the edges. In our current workaround this is not working so good. The plot will get rendered properly with the corresponding colors, but the legend does not know what to do, and will only use one of the scale elements, without a warning!\n\n\nggraph(net, layout = layout_sf) +\n  geom_sf(\n    data = st_as_sf(net, \"edges\"), \n    aes(color = as.numeric(edge_circuity()))\n  ) +\n  geom_node_point(\n    aes(color = centrality_betweenness())\n  ) +\n  coord_sf(crs = st_crs(net))\n\n\n\n\nFaceting edges\nAnother missing stone is faceting by edges. This currently gives an error:\n\n\nggraph(net, layout = layout_sf) +\n  geom_sf(data = st_as_sf(net, \"edges\")) +\n  facet_edges(~type)\n\n\nError in seq_len(length(data) - 1): argument must be coercible to non-negative integer\n\nWhat to do then? Remember that I mention a PR? Well, I am working there to fix these issues, some of them already have a fix, others don’t. I would certainly appreciate any help I can get. I opened an issue to illustrate the progress of my PR. Basically I am stuck with understanding ggproto objects to allow an integration of edges in geographical space.\nIf you feel like exploring what I have got so far, install ggraph from my forked repo. Beware, this will replace the original ggraph, so do this under your own risk.\n\n\nremotes::install_github(\"loreabad6/ggraph\")\n\n\n\nShow me more!\nWhile testing my ggraph implementation, I started looking for some spatial network visualization examples done with R that I could recreate with my code. Here I added two examples of what I came up with, and will probably add more to this GitHub repository if you are interested in following it up. Bear in mind that most of these examples are created with remotes::install_github(\"loreabad6/ggraph\").\nBreak Free from Plastic\n\n\n\n\nFor week 5 of 2021 in the Tidy Tuesday weekly data project, we analyzed data from the “Break Free from Plastic” initiative. Here is a step by step guide on how to recreate the final plot.\nAirports in the U.S.\n\n\n\n\nThis example is inspired on this wonderful blogpost on Network Visualization by Katherine Ognyanova, where I tried to recreate the last plot showing airport connections and visitors in the U.S. Here is the code to reproduce.\nThe fourth way of visualizing a graph on a map\n\n\n\n\nIn his very helpful blogpost, Markus Neteler guides us through three different ways to plot a spatial graph on a map. With the ggraph and sfnetworks combination, we can add a fourth way! Check here how to recreate this plot.\n\n\n\n",
    "preview": "posts/2021-03-05-geospatial-network-visualization/figs/preview.png",
    "last_modified": "2023-04-26T09:04:15+00:00",
    "input_file": {},
    "preview_width": 1536,
    "preview_height": 480
  }
]
